app/views/questions/_question.html.erb

SELECT "questions".* FROM "questions"
---
      <div class="flex items-center mb-2">
        <input type="checkbox" id="markquestion<%=question.id%>" onclick="visited(<%=question.id%>)" class="visited<%=question.id%> float-left" value= "<%=question.id%>" onclick="markQuestion(this.value)">