app/views/questions/index.html.erb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
     <div>
        <h3 class="text-lg leading-6 font-medium text-gray-900">Questions <%= Subject.find(params[:id]).name %></h3>