app/views/questions/quiz_questions.html.erb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <div class="text-lg leading-6 font-medium text-gray-900">
    Questions <%= Subject.find(params[:id]).name %>