app/controllers/dashboards_controller.rb

    def show

        # @dashboaard = Profile.new
        if current_admin.email == "admin@gmail.com"
            # render
            @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"