app/controllers/questions_controller.rb

  def index
    # abort('here')
    if params[:id].present?
    @questions = Question.where(subject_id: params[:id]).paginate(:page => params[:page], :per_page => 5)
    else
      @questions = Question.all.paginate(:page => params[:page], :per_page => 2)
---
SELECT "questions".* FROM "questions" WHERE "questions"."subject_id" = ? LIMIT ? OFFSET ?  [["subject_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."subject_id" = ?  [["subject_id", 1]]
SELECT "questions".* FROM "questions" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"