app/controllers/questions_controller.rb

  def quiz_questions
    # abort('here')
    if params[:id].present?
      @questions = Question.where(subject_id: params[:id])
    else
      @questions = Question.all
    end
    unless session['previous_page'].nil?
      redirect_to session['previous_page']
      session['previous_page']=nil
    else
      @duration=@questions.first.subject.duration
---
SELECT "questions".* FROM "questions" WHERE "questions"."subject_id" = $1 LIMIT $2 OFFSET $3  [["subject_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]