app/controllers/questions_controller.rb

SELECT COUNT(*) FROM "questions" WHERE "questions"."subject_id" = $1  [["subject_id", 3]]
---
  def quiz_questions
    # abort('here')
    if params[:id].present?
      @questions = Question.where(subject_id: params[:id]).paginate(:page => params[:page], :per_page => 5)