app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "English"], ["created_at", "2022-03-03 17:00:51.466069"], ["updated_at", "2022-03-03 17:00:51.466069"]]
---
  def create
    @subject = Subject.new(subject_params)
    respond_to do |format|
      if @subject.save

UPDATE "subjects" SET "name" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["name", "Math"], ["updated_at", "2022-02-25 10:17:13.424352"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @subject.update(subject_params)