app/models/admin.rb

INSERT INTO "admins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "twiter-test@test.com"], ["full_name", "test"], ["uid", "1224"], ["avatar_url", "test_url"], ["created_at", "2021-12-14 11:27:03.106070"], ["updated_at", "2021-12-14 11:27:03.106070"]]
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "twiter-test@test.com"], ["LIMIT", 1]]
---
  def self.from_google(from_google_params)
    create_with(uid: from_google_params[:uid], full_name: from_google_params[:full_name], avatar_url: from_google_params[:avatar_url],password: "test").find_or_create_by!(email: from_google_params[:email])

SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "twiter-test@test.com"], ["LIMIT", 1]]
---
  def self.from_twitter(twiterparams)
    create_with(uid: twiterparams[:uid], full_name: twiterparams[:full_name], avatar_url: twiterparams[:avatar_url]).find_or_create_by!(email: twiterparams[:email])

INSERT INTO "admins" ("email", "full_name", "created_at", "updated_at", "phone_number", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def self.sign_up_with_credentials(adminparams)
    Admin.create(full_name: adminparams[:full_name],email: adminparams[:email], phone_number: adminparams[:phone_number], password: adminparams[:password])

SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "tester@gmail.com"], ["LIMIT", 1]]
INSERT INTO "profiles" ("email", "first_name", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "admin@gmail.com"], ["first_name", "admin@gmail.com"], ["admin_id", 1], ["created_at", "2022-03-03 16:59:06.522006"], ["updated_at", "2022-03-03 16:59:06.522006"]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "tester@gmail.com"], ["LIMIT", 1]]
---
  def save_profile
    Profile.create_with(first_name: self.full_name,email: self.email,admin: self ).find_or_create_by!(email: self.email)