app/views/layouts/dashboaard.html.erb

            <div class="flex">
            <% Subject.all.each do |subject| %>
---
SELECT "subjects".* FROM "subjects"